In [48]:
import pandas as pd

In [49]:
data_tech_class=pd.read_stata("ipc_unique.dta")

In [55]:
data_tech_class.head()

   docdb_family_id              mainarea34
0          8554171  Electrical Engineering
1         27517085               Chemistry
2          7915918               Chemistry
3         22889365  Electrical Engineering
4         23788431  Electrical Engineering

In [51]:
data_tech_class=data_tech_class[['docdb_family_id','mainarea34']]

In [52]:
data_tech_class.head()

   docdb_family_id              mainarea34
0          8554171  Electrical Engineering
1         27517085               Chemistry
2          7915918               Chemistry
3         22889365  Electrical Engineering
4         23788431  Electrical Engineering

In [53]:
data_octamine=pd.read_stata("ep_ma5_all.dta")

In [54]:
data_octamine.head()

   docdb_family_id1  docdb_family_id2  simMeasure
0            574528          38353081         355
1            574528          37907999         353
2            574528          10530091         345
3            574528          26220749         331
4            574528           8562083         322

In [56]:
len(data_octamine)

228955259

In [ ]:
#we check what are the tech classes of patents used by octamine

In [57]:
data_merged1=pd.merge(data_octamine,data_tech_class,left_on="docdb_family_id1",right_on="docdb_family_id")

In [60]:
len(data_merged1)

1325015457

In [61]:
len(data_octamine)

228955259

In [62]:
1325015457>228955259

True

In [63]:
data_tech_class['docdb_family_id'].value_counts()

docdb_family_id
21841414    472
25646068    461
53408550    451
29253594    427
45327470    379
           ...
60539540      1
21092904      1
21092905      1
21092906      1
87315323      1
Name: count, Length: 76640602, dtype: int64

In [64]:
data_merged1.head()

,docdb_family_id1,docdb_family_id2,simMeasure,docdb_family_id,mainarea34
0,574528,38353081,355,574528,Other Fields
1,574528,38353081,355,574528,Other Fields
2,574528,38353081,355,574528,Other Fields
3,574528,38353081,355,574528,Other Fields
4,574528,38353081,355,574528,Other Fields

In [65]:
data_merged1.rename(columns={'mainarea34':'docdb_familyid1_techclass'},inplace=True)
data_merged1.head()

,docdb_family_id1,docdb_family_id2,simMeasure,docdb_family_id,docdb_familyid1_techclass
0,574528,38353081,355,574528,Other Fields
1,574528,38353081,355,574528,Other Fields
2,574528,38353081,355,574528,Other Fields
3,574528,38353081,355,574528,Other Fields
4,574528,38353081,355,574528,Other Fields

In [66]:
data_merged1[['docdb_family_id1','docdb_family_id2','docdb_familyid1_techclass']]

            docdb_family_id1  docdb_family_id2 docdb_familyid1_techclass
0                     574528          38353081              Other Fields
1                     574528          38353081              Other Fields
2                     574528          38353081              Other Fields
3                     574528          38353081              Other Fields
4                     574528          38353081              Other Fields
...                      ...               ...                       ...
1325015452          49584502           9317575              Other Fields
1325015453          49584502           7698909              Other Fields
1325015454          49584502           3512249              Other Fields
1325015455          49584502          43877100              Other Fields
1325015456          49584502          38051546              Other Fields

[1325015457 rows x 3 columns]

In [67]:
data_merged2=data_merged1[['docdb_family_id1','docdb_family_id2','docdb_familyid1_techclass']]

In [68]:
data_merged3=pd.merge(data_octamine,data_tech_class,left_on="docdb_family_id2",right_on="docdb_family_id")

In [69]:
data_merged3.head()

,docdb_family_id1,docdb_family_id2,simMeasure,docdb_family_id,mainarea34
0,574528,38353081,355,38353081,Other Fields
1,574528,38353081,355,38353081,Other Fields
2,574528,37907999,353,37907999,Other Fields
3,574528,37907999,353,37907999,Other Fields
4,574528,37907999,353,37907999,Other Fields

In [70]:
data_merged3.rename(columns={'mainarea34':'docdb_familyid2_techclass'},inplace=True)
data_merged3.head()

,docdb_family_id1,docdb_family_id2,simMeasure,docdb_family_id,docdb_familyid2_techclass
0,574528,38353081,355,38353081,Other Fields
1,574528,38353081,355,38353081,Other Fields
2,574528,37907999,353,37907999,Other Fields
3,574528,37907999,353,37907999,Other Fields
4,574528,37907999,353,37907999,Other Fields

In [71]:
data_merged3[['docdb_family_id1','docdb_family_id2','docdb_familyid2_techclass']]

            docdb_family_id1  docdb_family_id2 docdb_familyid2_techclass
0                     574528          38353081              Other Fields
1                     574528          38353081              Other Fields
2                     574528          37907999              Other Fields
3                     574528          37907999              Other Fields
4                     574528          37907999              Other Fields
...                      ...               ...                       ...
1269975978          49584502          38051546              Other Fields
1269975979          49584502          38051546              Other Fields
1269975980          49584502          38051546              Other Fields
1269975981          49584502          38051546              Other Fields
1269975982          49584502          38051546              Other Fields

[1269975983 rows x 3 columns]

In [72]:
data_merged4=data_merged3[['docdb_family_id1','docdb_family_id2','docdb_familyid2_techclass']]

In [73]:
data_merged2.head()

   docdb_family_id1  docdb_family_id2 docdb_familyid1_techclass
0            574528          38353081              Other Fields
1            574528          38353081              Other Fields
2            574528          38353081              Other Fields
3            574528          38353081              Other Fields
4            574528          38353081              Other Fields

In [74]:
data_merged4.head()

   docdb_family_id1  docdb_family_id2 docdb_familyid2_techclass
0            574528          38353081              Other Fields
1            574528          38353081              Other Fields
2            574528          37907999              Other Fields
3            574528          37907999              Other Fields
4            574528          37907999              Other Fields

In [75]:
data_merged2['docdb_familyid1_techclass'].value_counts()

docdb_familyid1_techclass
Other Fields              929736351
Mechanical engineering    187580331
Chemistry                  90019398
Instruments                62948775
Electrical Engineering     54729602
Name: count, dtype: int64

In [77]:
data_merged4['docdb_familyid2_techclass'].value_counts()

docdb_familyid2_techclass
Other Fields              940381107
Mechanical engineering    165311295
Chemistry                  71369670
Electrical Engineering     47976721
Instruments                44936390
Name: count, dtype: int64

In [ ]:
#tech classes for the patents used in octamine are diverse

In [22]:
len(data_octamine)

228955259

In [23]:
len(data_merged2)

1325015457

In [24]:
len(data_merged4)

1269975983

In [78]:
len(data_tech_class)

109101031

In [79]:
data_merged2.head()

   docdb_family_id1  docdb_family_id2 docdb_familyid1_techclass
0            574528          38353081              Other Fields
1            574528          38353081              Other Fields
2            574528          38353081              Other Fields
3            574528          38353081              Other Fields
4            574528          38353081              Other Fields

In [80]:
data_merged4.head()

   docdb_family_id1  docdb_family_id2 docdb_familyid2_techclass
0            574528          38353081              Other Fields
1            574528          38353081              Other Fields
2            574528          37907999              Other Fields
3            574528          37907999              Other Fields
4            574528          37907999              Other Fields